
                <html lang="en" class="simpread-font simpread-theme-root" style='font-size: 60%!important;'>
                    <head>
                        <meta charset="utf-8">
                        <meta http-equiv="content-type" content="text/html; charset=UTF-8;charset=utf-8">
                        <meta http-equiv="X-UA-Compatible" content="IE=Edge">
                        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=1">
                        <meta name="author" content="Kenshin"/>
                        <meta name="description" content="简悦 SimpRead - 如杂志般沉浸式阅读体验的扩展" />
                        <meta name="keywords" content="Chrome extension, Chrome 扩展, 阅读模式, 沉浸式阅读, 简悦, 简阅, read mode, reading mode, reader view, firefox, firefox addon, userscript, safari, opera, tampermonkey"/>
                        <meta name="thumbnail" content="https://simpread-1254315611.cos.ap-shanghai.myqcloud.com/static/introduce-2.png"/>
                        <meta property="og:title" content="简悦 SimpRead - 如杂志般沉浸式阅读体验的扩展"/>
                        <meta property="og:type" content="website">
                        <meta property="og:local" content="zh_CN"/>
                        <meta property="og:url" content="http://ksria.com/simpread"/>
                        <meta property="og:image" content="https://simpread-1254315611.cos.ap-shanghai.myqcloud.com/static/introduce-2.png"/>

<p>The alternative statically-polymorphic implementation is this <a href="#id3">[1]</a>:</p>
<div><pre>template &lt;typename Implementation&gt;
class CRTPInterface {
public:
  void tick(uint64_t n) {
    impl().tick(n);
  }

  uint64_t getvalue() {
    return impl().getvalue();
  }
private:
  Implementation&amp; impl() {
    return *static_cast&lt;Implementation*&gt;(this);
  }
};

class CRTPImplementation : public CRTPInterface&lt;CRTPImplementation&gt; {
  uint64_t counter;
public:
  CRTPImplementation()
    : counter(0) {
  }

  void tick(uint64_t n) {
    counter += n;
  }

  uint64_t getvalue() {
    return counter;
  }
};

template &lt;typename Implementation&gt;
void run_crtp(CRTPInterface&lt;Implementation&gt;* obj) {
  for (unsigned i = 0; i &lt; N; ++i) {
    for (unsigned j = 0; j &lt; i; ++j) {
      obj-&gt;tick(j);
    }
  }
}

</pre></div>
</div>
<div>
<h3 id="sr-toc-3">Generated code - how virtual calls look under the hood</h3>
<p>Now let's spend some time studying the machine code generated by gcc -O2 (version 4.8) from the code above. The code for <tt><span>DynamicImplementation::tick</span></tt> is very compact:</p>
<div><pre>0000000000400cf0 &lt;_ZN21DynamicImplementation4tickEm&gt;:
  400cf0:       add    %rsi,0x8(%rdi)
  400cf4:       retq

</pre></div>
<p>To understand what this means, some familiarity with the <a href="http://mentorembedded.github.io/cxx-abi/abi.html">Itanium C++ ABI</a> is required. The ABI in this case mandates both the name mangling that produces the weird symbol name, and the layout of the object in memory, which mandates how its fields are accessed. Here's a short description for the code above:</p>
<p>Since <tt>DynamicInterface</tt> has virtual methods, the class hierarchy it begets comes with a virtual method table, a pointer to which resides in each object. This is the way the compiler arranges for the runtime code to call the correct method when an actual object is used. The address of the virtual method table (<tt>vptr</tt>) is in the beginning of the object, and the actual class members come afterwards. So <tt>counter</tt> lives at offset 8 in <tt>DynamicImplementation</tt> objects.</p>

<p><tt>%rdi</tt> is the first argument to <tt>tick</tt>, which is the hidden <tt>this</tt> pointer - the address of the object. Hence <tt><span>0x8(%rdi)</span></tt> is the address of <tt><span>this-&gt;counter</span></tt>. The instruction, then, adds <tt>n</tt> (passed in <tt>%rsi</tt> according to the calling convention) to <tt><span>this-&gt;counter</span></tt>.</p>
<p>By the way, whenever you're curious about object layouts and want to verify your understanding of the ABI, I find <a href="http://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/">Clang's ability to dump the class record layouts</a> very helpful. In this case:</p>
<div><pre>*** Dumping AST Record Layout
   0 | class DynamicImplementation
   0 |   class DynamicInterface (primary base)
   0 |     (DynamicInterface vtable pointer)
   8 |   uint64_t counter
     | [sizeof=16, dsize=16, align=8
     |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
   0 | class CRTPImplementation
   0 |   class CRTPInterface&lt;class CRTPImplementation&gt; (base) (empty)
   0 |   uint64_t counter
     | [sizeof=8, dsize=8, align=8
     |  nvsize=8, nvalign=8]

</pre></div>
<p>On to the invocation of <tt>tick</tt> now. This is the disassembly for <tt>run_dynamic</tt>, annotated with comments:</p>
<div><pre>0000000000400c10 &lt;_Z11run_dynamicP16DynamicInterface&gt;:
  400c10:       push   %r13
  400c12:       mov    $0x1,%r13d
  400c18:       push   %r12
        // r12d holds i, initialized to 0
  400c1a:       xor    %r12d,%r12d
  400c1d:       push   %rbp
        // Place obj in %rbp
  400c1e:       mov    %rdi,%rbp
  400c21:       push   %rbx
  400c22:       sub    $0x8,%rsp
  400c26:       nopw   %cs:0x0(%rax,%rax,1)
  400c30:       test   %r12d,%r12d
        // when i is 0, the body of the loop won't run, so increment
        // both i and j and try again.
  400c33:       je     400c5e
        // rbx holds j, initialized to 0
  400c35:       xor    %ebx,%ebx
  400c37:       nopw   0x0(%rax,%rax,1)
        // Place the address of obj's vtable in rax
